///// DB에 저장이 되는 항목인 경우 CMB_CONST_XXXXX 의 형태로 CONST를 붙임.

CMB_DB_WIND_KR_BUILD_TYPE_CLOSE               = "Enclosed"
CMB_DB_WIND_KR_BUILD_TYPE_POPEN               = "Partially Opened"
CMB_DB_WIND_KR_BUILD_TYPE_WOPEN               = "Widely Opened"
CMB_DB_WIND_KR_BUILD_TYPE_FOPEN               = "Opened"
CMB_DB_WIND_KR_BUILD_TYPE_SROPN               = "Stand-alone Roof ( Open )"
CMB_DB_WIND_KR_BUILD_TYPE_SRCLS               = "Stand-alone Roof ( Closed )"

CMB_DB_WIND_KDS22_BUILD_TYPE_CLOSE_ONE_SIDE   = "Enclosed ( Opening on 1 Side )"
CMB_DB_WIND_KDS22_BUILD_TYPE_CLOSE_FACING_2   = "Enclosed ( Opening on Facing 2 Sides )"
CMB_DB_WIND_KDS22_BUILD_TYPE_CLOSE_ADJCNT_2   = "Enclosed ( Opening on Adjacent 2 Sides )"
CMB_DB_WIND_KDS22_BUILD_TYPE_CLOSE_ADJCNT_3   = "Enclosed ( Opening on Adjacent 3 Sides )"
CMB_DB_WIND_KDS22_BUILD_TYPE_CLOSE_ALL_ROOF   = "Enclosed ( Opening on All Sides and Roof )"
CMB_DB_WIND_KDS22_BUILD_TYPE_CLOSE_ALL_SIDE   = "Enclosed ( Opening on All Sides )"
CMB_DB_WIND_KDS22_BUILD_TYPE_CLOSE_NO_OPENS   = "Enclosed ( No Openings )"
CMB_DB_WIND_KDS22_BUILD_TYPE_PART_ENCLOSE_1   = "Partially Enclosed ( Widely Opened, Type 1 )"
CMB_DB_WIND_KDS22_BUILD_TYPE_PART_ENCLOSE_2   = "Partially Enclosed ( Widely Opened, Type 2 )"
CMB_DB_WIND_KDS22_BUILD_TYPE_PART_SILO_CHMN   = "Partially Enclosed ( Silo, Chimney with Open Top )"
CMB_DB_WIND_KDS22_BUILD_TYPE_OPEN_STRUCTURE   = "Opened"
CMB_DB_WIND_KDS22_BUILD_TYPE_STND_ROOF_OPEN   = "Stand-alone Roof ( Open )"
CMB_DB_WIND_KDS22_BUILD_TYPE_STND_ROOF_CLOS   = "Stand-alone Roof ( Closed )"

CMB_DB_WIND_US_BUILD_TYPE_ENCLOSE             = "Enclosed"
CMB_DB_WIND_US_BUILD_TYPE_PARTENC             = "Partially Enclosed"

CMB_DB_SNOW_BUILD_TYPE_HEATED                 = "Heated Building"
CMB_DB_SNOW_BUILD_TYPE_UNHEAT                 = "Unheated Building"

CMB_DB_WIND_KR_ROOF_TYPE_GABLET               = "Gablet"
CMB_DB_WIND_KR_ROOF_TYPE_MSLOPE               = "Mono Slope"
CMB_DB_WIND_KR_ROOF_TYPE_MGABLE               = "Multi Gable"
CMB_DB_WIND_KR_ROOF_TYPE_STOOTH               = "Sawtooth"

CMB_DB_WIND_US_ROOF_TYPE_FLAT                 = "Flat"
CMB_DB_WIND_US_ROOF_TYPE_GABLE                = "Gable"
CMB_DB_WIND_US_ROOF_TYPE_MULTIGABLE           = "Multi Gable"
CMB_DB_WIND_US_ROOF_TYPE_MONOSLOPE            = "Mono Slope"
CMB_DB_WIND_US_ROOF_TYPE_SAWTOOTH             = "Sawtooth"

CMB_DB_SNOW_KR_ROOF_TYPE_SLOPED               = "Sloped"
CMB_DB_SNOW_KR_ROOF_TYPE_CURVED               = "Curved Roof"
CMB_DB_SNOW_KR_ROOF_TYPE_MFOLDP               = "Multiple Folded Plate"
CMB_DB_SNOW_KR_ROOF_TYPE_BVAULT               = "Barrel Vault"
CMB_DB_SNOW_KR_ROOF_TYPE_STOOTH               = "Sawtooth"

CMB_DB_SNOW_US_ROOF_TYPE_SLOPE                = "Slope"
CMB_DB_SNOW_US_ROOF_TYPE_GABLE                = "Gable"
CMB_DB_SNOW_US_ROOF_TYPE_CURVED               = "Curved"
CMB_DB_SNOW_US_ROOF_TYPE_MULTIFOLD            = "Multiple Folded Plate"
CMB_DB_SNOW_US_ROOF_TYPE_BARREL               = "Barrel Vault"
CMB_DB_SNOW_US_ROOF_TYPE_SAWTOOTH             = "Sawtooth"

CMB_DB_WIND_CHECK_POSITION_1                  = "1"
CMB_DB_WIND_CHECK_POSITION_2                  = "2"
CMB_DB_WIND_CHECK_POSITION_3                  = "3"
CMB_DB_WIND_CHECK_POSITION_4                  = "4"
CMB_DB_WIND_CHECK_POSITION_5                  = "5"

CMB_CONST_DB_BUILDING_IMPORTANT_CATEGORY_S    = "특"
CMB_CONST_DB_BUILDING_IMPORTANT_CATEGORY_1    = "1"
CMB_CONST_DB_BUILDING_IMPORTANT_CATEGORY_2    = "2"
CMB_CONST_DB_BUILDING_IMPORTANT_CATEGORY_3    = "3"

CMB_CONST_DB_BUILDING_IMPORTANT_CATEGORY_I    = "I"
CMB_CONST_DB_BUILDING_IMPORTANT_CATEGORY_II   = "II"
CMB_CONST_DB_BUILDING_IMPORTANT_CATEGORY_III  = "III"
CMB_CONST_DB_BUILDING_IMPORTANT_CATEGORY_IV   = "IV"

CMB_DB_REPORT_TYPE_DET                        = "Detail Report"
CMB_DB_REPORT_TYPE_SUM                        = "Summary Report"
CMB_DB_REPORT_TYPE_RES                        = "Calculation Summary"

CMB_DB_SEIS_SOIL_LOAD_STATIC                  = "Static Seismic Load"
CMB_DB_SEIS_SOIL_LOAD_SINGLE                  = "Single Cosine Method"
CMB_DB_SEIS_SOIL_LOAD_DOUBLE                  = "Double Cosine Method"
CMB_DB_SEIS_SOIL_LOAD_USRRES                  = "User Response Method"